In [20]:
import numpy as np
import pandas as pd

## Pivot Tables

In [21]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}
df = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [22]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    808     27   John  January      Q1
1  2023-01-02       B   West    495     78   Mary  January      Q1
2  2023-01-03       C  North    360     29    Bob  January      Q1
3  2023-01-04       D  South    309     78  Alice  January      Q1
4  2023-01-05       A   East    621     37   John  January      Q1
5  2023-01-06       B   West    362     25   Mary  January      Q1
6  2023-01-07       C  North    985     20    Bob  January      Q1
7  2023-01-08       D  South    861     79  Alice  January      Q1
8  2023-01-09       A   East    186     31   John  January      Q1
9  2023-01-10       B   West    753     84   Mary  January      Q1
10 2023-01-11       C  North    477     27    Bob  January      Q1
11 2023-01-12       D  South    178     94  Alice  January      Q1
12 2023-01-13       A   East    547     14   John  January      Q1
13 2023-01-14       B   West    270     28   Mary  January      Q1
14 2023-01-15       C  North    849     34    Bob  January      Q1
15 2023-01-16       D  South    439     26  Alice  January      Q1
16 2023-01-17       A   East    805     37   John  January      Q1
17 2023-01-18       B   West    456     65   Mary  January      Q1
18 2023-01-19       C  North    110     49    Bob  January      Q1
19 2023-01-20       D  South    614     93  Alice  January      Q1

In [23]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product")

Product      A      B      C      D
Region
East     593.4    NaN    NaN    NaN
North      NaN    NaN  556.2    NaN
South      NaN    NaN    NaN  480.2
West       NaN  467.2    NaN    NaN

In [24]:
# In above table, if no comination is found then nan is filled
# and if multiple values are possible for one set of combination then by default mean is taken

In [25]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product",aggfunc="median")

Product      A      B      C      D
Region
East     621.0    NaN    NaN    NaN
North      NaN    NaN  477.0    NaN
South      NaN    NaN    NaN  439.0
West       NaN  456.0    NaN    NaN

In [26]:
# Use of pivot table is in heatmap

In [27]:
pivot2 = pd.pivot_table(df,values=["Sales","Units"],index="Region",columns="Product")

In [28]:
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     593.4    NaN    NaN    NaN  29.2   NaN   NaN   NaN
North      NaN    NaN  556.2    NaN   NaN   NaN  31.8   NaN
South      NaN    NaN    NaN  480.2   NaN   NaN   NaN  74.0
West       NaN  467.2    NaN    NaN   NaN  56.0   NaN   NaN

## Cross Tabs

In [29]:
pd.crosstab(df["Region"],df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

In [30]:
# Pivot Tables do aggregation while CrossTab shows the count of particular set of combination